{
    "EDUCATION": [
        {
            "degree": "Bachelor of Science in Computer Science and Engineering",
            "passing_year": 2022,
            "session": "2017-2021",
            "institute": "Daffodil Institute of IT (DIIT)",
            "type": "Education",
            "description": "Daffodil Institute of IT (DIIT) became affiliated to the National University for conducting the BSc (Professional) in Computer Science and BBA programs."
        },
        {
            "degree": "Higher Secondary Certificate (HSC)",
            "passing_year": 2016,
            "session": "2015-2016",
            "institute": "Patuakhali Government College",
            "type": "Education",
            "description": "Patuakhali Government College is a educational institution in Patuakhali district of Barisal division."
        },
        {
            "degree": "Professional Web Design & Development",
            "passing_year": 2022,
            "session": "2021-2022",
            "institute": "Creative IT Institute , Dhaka",
            "type": "Training",
            "description": "Creative IT is an institution where empowering the community with an excellent standard of learning is what they desire. They endeavour for the continuous improvement of their leaders who will work to construct a better future."
        }
    ],
    "EXPERIENCE": [
        {
            "designation": "Software Engineer",
            "start_date": "2024-07-01",
            "end_date": null,
            "company": "Ambala IT",
            "responsibilities": [
                "Enhanced microfinance software by adding new features and fixing bugs to improve loan processing, client management, and financial reporting.",
                "Developed and automated microfinance reports, including income statements and balance sheets, ensuring accurate data analysis and compliance.",
                "Customized microfinance tools to meet specific needs, optimizing performance and user experience.",
                "Optimized ERP workflows by streamlining processes, resulting in improved system performance and user satisfaction."
            ]
        },
        {
            "designation": "Full-Stack Web Developer",
            "start_date": "2023-03-01",
            "end_date": "2024-06-30",
            "company": "Nano Information Technology (Nanosoft)",
            "responsibilities": [
                "Leveraged my expertise in Laravel to craft web applications for seamless user experiences.",
                "Collaborated with diverse teams, including project managers and designers, to implement features aligned with project goals using JavaScript, React.js, and AJAX.",
                "Managed database design and performance using MySQL, optimizing queries and ensuring data integrity.",
                "Utilized Git for version control, enabling efficient collaboration with fellow developers.",
                "Pursued continuous learning to stay updated with the latest trends and best practices in Laravel and web development."
            ]
        },
        {
            "designation": "Executive - Support Engineer",
            "start_date": "2022-09-02",
            "end_date": "2023-02-28",
            "company": "One Sky Communications Limited",
            "responsibilities": [
                "Provided technical support for ISP infrastructure, routers, and switches to end-users based on requirements.",
                "Participated in on-call rotation schedule for nights and weekends.",
                "Coordinated with the network operation team to ensure smooth rollout plans and service delivery.",
                "Performed other duties and responsibilities as required and assigned."
            ]
        }
    ],
    "SOCIAL": {
        "facebook": "https://www.facebook.com/mohammadalamin.dev",
        "linkedin": "https://www.linkedin.com/in/mdalamin1998/",
        "github": "https://github.com/alaminwebdev"
    },
    "CONTACT": {
        "email": "mohammadalamin.dev@gmail.com",
        "phone": "+8801718695350",
        "location": "Dhaka, Bangladesh",
        "dob": "1998/10/25"
    },
    "BIO": {
        "short_bio": "Dedicated software engineer based in Dhaka, creating dynamic and user-friendly applications that drive innovation.",
        "long_bio": "I'm Md. Al Amin, a software engineer at Ambala IT. I specialize in Laravel, JavaScript, and MySQL, delivering efficient and user-focused web applications.",
        "description": "👋 Hi, I'm Md. Al Amin, a passionate Software Engineer at Ambala IT, dedicated to building seamless and user-friendly web applications.<br><br>💻 <strong>Back-end Expertise:</strong> Specializing in PHP and Laravel to develop robust and scalable applications.<br><br>🎨 <strong>Front-end Skills:</strong> Proficient in JavaScript and Vue.js, creating interactive and dynamic user interfaces.<br><br> 🚀 <strong>Modern Tools:</strong> Experienced with Inertia.js and Vite for efficient and high-performance development.<br><br> 🗃️ <strong>Database Management:</strong> Skilled in MySQL, ensuring data integrity and optimal performance.<br><br>⚡ <strong>Dynamic Web Development:</strong> Mastering AJAX for responsive and real-time user experiences.",
        "career_summary": "🎓 I graduated with a Bachelor of Science in Computer Science and Engineering from Daffodil Institute of IT in 2022. Since then, I have worked across multiple roles, currently as a Software Engineer at Ambala IT, where I specialize in back-end and front-end development using PHP, Laravel, Vue.js, and MySQL.<br><br> 💼 Previously, I worked as a Full-Stack Web Developer at Nano Information Technology (Nanosoft) and as a Support Engineer at One Sky Communications Limited, gaining extensive experience in both web development and technical support. 🌱"
    }
}